''''''
'''
输出、打印：print
输入：input
input默认返回类型：字符串类型
数据类型：字符串类型str：引号引起来    
          数字类型：整数类型int：无小数点
                    浮点类型float：有小数点
          布尔类型：True和False
查看数据类型：type(数据)
数据类型的转换：str转成int：纯数字的字符串类型（无小数点）
                str转成float：纯数字的字符串类型（有小数点）
分支结构：单分支：if。。。
         双分支：if。。。else。。。  （只能进一个洞）
         多分支：if。。。elif。。。else。。。   （只能进一个洞，elif有无数个）
算术运算符7(数字类型使用)： +  -  *  /(返回浮点类型) %（求余，返回整数类型）  **（幂运算） //(整除，向下取整)
赋值运算符8（后面给前面）：=  +=  -=   *=   /=   //=   **=   %=
比较运算符6：>   >=   <   <=   ==   !=
逻辑运算符3：and（且、与）：真真为真      
            or（或）：假假为假      
            not（非、否）：真为假，假为真   
成员运算符2（字符串类型使用）：in（前面存在于后面）
布尔类型：真：True
         假：False
变量的命名：不能以数字开头，以字母，数字，_组成（不考虑汉字）
拼接：+:只能是字符串进行拼接，无空格
     ,：只能在print中使用，可以在字符串和数字进行拼接，有空格（取消空格：sep=''）
+在不同的类型的使用意义：字符串：拼接
                        数字类型：相加
缩进：1个Tab，4个空格
注释：单行注释：#
      多行注释：三对单引号或者三对双引号
while循环：计算机做重复或者有规律的步骤
循环体：重复的内容
死循环：while True   (条件一直为真，条件一直成立)
break：跳出循环      只能在循环体中使用，执行其他语句
导入随机库：import random     （写在第一行）
随机产生整数：random.randint(小,大)------包头包尾
跳过：continue   只能在循环体中使用，不执行continue下面的语句

'''


