''''''
'''
数据类型：每种数据类型代表了某一类性质的数据
数据类型：
        数字：
            整数--int：不含小数点的纯数字组成的数据
            浮点--float：含有小数点的纯数字数据
        字符串--str
        列表--list
        元组--tuple
        集合--set
        字典--dict
四则运算：
        加法：+
        减法：-
        乘法：*
        除法：/
复合运算：本身的值进行运算后再赋值给本身
        加法赋值：+=
        减法赋值：-=
        乘法赋值：*=
        除法赋值：/=
字符串的创建：使用单引号或双引号来创建
type(数据)：查看数据类型并返回值
+：加号在字符串类型中是拼接字符串
input()：输入的数据是字符串类型
转换类型：
        转成字符串：str(数据)
        转成整数：int(纯数字的数据)
        转成浮点：float(数字和小数点的数据)

'''
'''项目'''
# meal1 = '汉堡,薯条,可乐'
# meal2 = '鸡肉卷,沙拉,柠檬茶'
# food10 = '汉堡,鸡肉卷,牛肉面,三明治'
# food6 = '薯条,沙拉,花生米,可乐,柠檬茶,紫菜汤'
# xz=input('是否选择套餐(y/n)：')
# if xz=='y':
#     tc=input('请选择套餐')
#     if tc=='1':
#         print(meal1,'共20元')
#     elif tc=='2':
#         print(meal2,'共20元')
#     else:
#         print('请输入正确的套餐编号')
# elif xz=='n':
#     money=0
#     cp1=input('请选择菜品1：')
#     cp2=input('请选择菜品2：')
#     cp3=input('请选择菜品3：')
#     if cp1 in food6:
#         money+=6
#     elif cp1 in food10:
#         money+=10
#     if cp2 in food6:
#         money+=6
#     elif cp2 in food10:
#         money+=10
#     if cp3 in food6:
#         money+=6
#     elif cp3 in food10:
#         money+=10
#     print(cp1,cp2,cp3,'共',money,'元')


'''---------------------------------------------------------------------------------------'''




















