''''''
'''
key in dict：判断”键“是否在字典中
            如果键在字典中返回True，否则返回False
del dict[key]：删除字典中的某一键值对
                如果键不存在于字典中，则会引发错误
dic1.update(dict2)：其他字典dict2中的键值对更新到指定字典dict1中
                    如果dict2与dict1有相同的键名，则dict1原有的键值对会被dict2中相同键名的键值对覆盖

'''
'''练习一'''
# dic = {'河北': {'保定': ['004', '012'], '唐山': ['015', '003', '021'], '廊坊': ['025', '017'],
#               '石家庄': ['002', '028', '008'], '秦皇岛': ['006', '007'], '张家口': ['011', '013', '026'],
#               '承德': ['024'], '沧州': ['001'], '衡水': ['014', '035'], '邢台': ['009', '016'],
#               '邯郸': ['018', '027'], '定州': ['029'], '辛集': ['033']},
#        '河南': {'安阳': ['005', '023']},
#        '北京': {'北京': ['010', '019', '020', '022', '030', '031']},
#        '天津': {'天津': ['032', '035']}}
# for k,v in dic.items():
#     for k1,v1 in v.items():
#         if k1=='石家庄':
#             print(v1)


'''练习二'''
# dic = {'河北': {'保定': ['004', '012'], '唐山': ['015', '003', '021'], '廊坊': ['025', '017'],
#               '石家庄': ['002', '028', '008'], '秦皇岛': ['006', '007'], '张家口': ['011', '013', '026'],
#               '承德': ['024'], '沧州': ['001'], '衡水': ['014', '035'], '邢台': ['009', '016'],
#               '邯郸': ['018', '027'], '定州': ['029'], '辛集': ['033']},
#        '河南': {'安阳': ['005', '023']},
#        '北京': {'北京': ['010', '019', '020', '022', '030', '031']},
#        '天津': {'天津': ['032', '035']}}
# for k,v in dic.items():
#     for k1,v1 in v.items():
#         if '001' in v1:
#             print(k1)


'''使用in操作符判断“键”是否在字典中'''
# dic={'姓名':'编程猫','爱好':'编程'}
# if '姓名' in dic:
#     print('键在字典中')


'''练习三'''
# dic = {'河北': {'保定': ['004', '012'], '唐山': ['015', '003', '021'], '廊坊': ['025', '017'],
#               '石家庄': ['002', '028', '008'], '秦皇岛': ['006', '007'], '张家口': ['011', '013', '026'],
#               '承德': ['024'], '沧州': ['001'], '衡水': ['014', '035'], '邢台': ['009', '016'],
#               '邯郸': ['018', '027'], '定州': ['029'], '辛集': ['033']},
#        '河南': {'安阳': ['005', '023']},
#        '北京': {'北京': ['010', '019', '020', '022', '030', '031']},
#        '天津': {'天津': ['032', '035']}}
# for k,v in dic.items():
#     if '石家庄' in v:
#         v['石家庄'].remove('008')
#         print('目前邮寄到石家庄市的包裹有：',v['石家庄'])
#     if '唐山' in v:
#         v['唐山'].append('008')
#         print('目前邮寄到唐山市的包裹有：',v['唐山'])



'''del dict[key]：删除字典中的某一键值对'''
# dic={'姓名':'编程猫','爱好':'编程'}
# del dic['姓名']
# print(dic)



'''update()：其他字典中的键值对更新到指定字典中'''
# dic={'姓名':'编程猫','爱好':'编程'}
# dic2={'姓名':'codemao','属性':'精灵'}
# dic.update(dic2)
# print(dic)


'''练习四'''
# dic = {'河北': {'保定': ['004', '012'], '唐山': ['015', '003', '021'], '廊坊': ['025', '017'],
#               '石家庄': ['002', '028', '008'], '秦皇岛': ['006', '007'], '张家口': ['011', '013', '026'],
#               '承德': ['024'], '沧州': ['001'], '衡水': ['014', '035'], '邢台': ['009', '016'],
#               '邯郸': ['018', '027'], '定州': ['029'], '辛集': ['033']},
#        '河南': {'安阳': ['005', '023']},
#        '北京': {'北京': ['010', '019', '020', '022', '030', '031']},
#        '天津': {'天津': ['032', '035']}}
# dic2 = {'东城区': ['010'],
#         '昌平区': ['019'],
#         '通州区': ['020'],
#         '大兴区': ['022'],
#         '海淀区': ['030'],
#         '朝阳区': ['031']}
# for k,v in dic.items():
#     if '北京' in v:
#         del v['北京']
#         v.update(dic2)
# print(dic)


'''-----------------------------------------------------------------------------'''
