# 京津冀经济圈内35个包裹邮寄目的地汇总
dic = {'河北': {'保定': ['004', '012'], '唐山': ['015', '003', '021'], '廊坊': ['025', '017'],
              '石家庄': ['002', '028', '008'], '秦皇岛': ['006', '007'], '张家口': ['011', '013', '026'],
              '承德': ['024'], '沧州': ['001'], '衡水': ['014', '035'], '邢台': ['009', '016'],
              '邯郸': ['018', '027'], '定州': ['029'], '辛集': ['033']},
       '河南': {'安阳': ['005', '023']},
       '北京': {'北京': ['010', '019', '020', '022', '030', '031']},
       '天津': {'天津': ['032', '035']}}

# 将“008”号包裹目的地修改为唐山（原目的地为石家庄）
for k, v in dic.items():
    if '石家庄' in v:
        v['石家庄'].remove('008')
        print('目前邮寄到石家庄市的包裹有：', v['石家庄'])
    if '唐山' in v:
        v['唐山'].append('008')
        print('目前邮寄到唐山市的包裹有：',v['唐山'])

