'''练习1工程包——智慧找零'''
'''
顾客购买了一些商品，共花费了整数金额，但他只有一张一百元的纸币，请编写程序计算出最合适的找零方案。
收银台的货币面额有：1元、5元、10元、20元、50元。

输入应付金额，输出找零的每张面额。
如:
Input：
输入应付多少：26
Output：
50
20
1
1
1
1
'''

#请在下方进行程序编写


'''练习2工程包——无人售卖机v1.0'''
'''
顾客选择一定整数金额商品后，付款给售卖机，售卖机进行自动收钱和找零。
收钱和找零的面额有：1元、5元、10元、20元、50元。

输入应付金额，然后多次输入付款面额，输入end，付款结束，输出实际收款金额和找零的每张面额。
如：
Input：
输入应付多少：26
收钱：20
收钱：20
收钱：end
实际收款：40
Output：
10
1
1
1
1
'''

#请在下方进行程序编写


'''练习3工程包——无人售卖机v2.0'''
'''
顾客选择一定整数金额商品后，付款给售卖机，售卖机进行自动收钱和找零。
收钱和找零的面额有：1元、5元、10元、20元、50元。

输入应付金额，然后多次输入付款面额，输入end，付款结束，输出要找零的面额和其张数。
如：
Input：
输入应付多少：26
收钱：20
收钱：20
收钱：end
实际收款：40
Output：
10元 x 1
1元 x 4
'''

#请在下方进行程序编写


'''练习4工程包——幸运"7"游戏"'''
'''
计算机从某个数开始进行幸运"7"游戏，输出这个数字到1000之间所有符合游戏规则的数字。

输入起始数字，输出范围内所有符合规则的数字，最后输出游戏结束。
如：
Input:
请输入一个数:990
Output:
991
992
993
995
996
998
999
1000
幸运"7"游戏结束！
'''

#请在下方进行程序编写



