''''''
'''
字典：可变的数据类型，存放具有映射（对应）关系的数据
      键:值-------表示对应关系
      键：是唯一的，不可重复，
          键是不可变的数据类型，通常是str、数字
      值：没有限制，
          可以是任何数据类型
      访问：通过键来访问值，不是索引
            访问字典里不存在的键的值会报错
      修改：通过键来修改值
      添加：添加字典中不存在的键则是添加键值对
            添加字典中存在的键则是修改该键的值
字典遍历：for k,v in m.items()
          k：字典中的键
          v：字典中的值
不可变数据类型：更改后地址发生改变，即一个地址只能存储一个数据，如数字、字符串、元组
可变数据类型：更改地址不发生改变，即一个地址可以存多个数据，如集合、列表、字典

'''
'''实践一'''
# L=['零','壹','貮','叁','肆','伍','陆','柒','捌','玖']
# for i in range(10):
#     print(str(i)+':'+L[i])


'''字典的操作：访问、修改、添加'''
# dic1={
#     '语文':98,
#     '数学':95,
#     '英语':92,
#     '体育':90,
#     '音乐':88,
#     '美术':90
# }
# # 字典的访问
# print(dic1['语文'])
# # 字典的修改
# dic1['音乐']=93
# print(dic1)
# # 字典的添加
# dic1['化学']=80
# print(dic1)
# dic1['音乐']=100
# print(dic1)


'''实践二'''
# dic={
#     '0':'零',
#     '1':'壹',
#     '2':'貮',
#     '3':'叁',
#     '4':'肆',
#     '5':'伍',
#     '6':'陆',
#     '7':'柒',
#     '8':'捌',
#     '9':'玖'
# }
# print(dic['7'])
# print(dic['9'])


'''字典遍历'''
# dic1={
#     '语文':98,
#     '数学':95,
#     '英语':92,
#     '体育':90,
#     '音乐':88,
#     '美术':90
# }
# for k,v in dic1.items():
#     print(k)
#     print(v)
#     print(dic1[k])
#     print()


'''实践四'''
# dic={
#     '0':'零',
#     '1':'壹',
#     '2':'貮',
#     '3':'叁',
#     '4':'肆',
#     '5':'伍',
#     '6':'陆',
#     '7':'柒',
#     '8':'捌',
#     '9':'玖'
# }
# for k,v in dic.items():
#     print(k+':'+v)


'''项目'''
# dic={
#     '0':'零',
#     '1':'壹',
#     '2':'貮',
#     '3':'叁',
#     '4':'肆',
#     '5':'伍',
#     '6':'陆',
#     '7':'柒',
#     '8':'捌',
#     '9':'玖'
# }
# dic2={
#     0:'元',
#     1:'拾',
#     2:'佰',
#     3:'仟',
#     4:'万',
#     5:'拾万',
#     6:'佰万',
#     7:'仟万',
#     8:'亿',
#     9:'拾亿',
#     10:'佰亿',
#     11:'仟亿'
# }
# a=int(input('输入数字：'))
# astr=str(a)
# L=[]
# for i in astr:
#     L.append(dic[i])
# print(L)
# L2=[]
# for i in range(len(L)):
#     L2.append(dic2[i])
# print(L2)
# L2.reverse()
# print(L2)
# L3=[]
# for i in range(len(L)):
#     L3.append(L[i])
#     L3.append(L2[i])
# print(L3)
# s=''.join(L3)
# print(s)
# # s=''
# # for i in L3:
# #     s+=i
# # print(s)


'''-----------------------------------------------------------------------------'''




